openFOAMTry/simFile/try2/constant/reactions
elements        5(O H C N Ar);

species         
16
(
H2
H
O
O2
OH
H2O
HO2
H2O2
CH4
CH3
CO
CO2
HCO
CH2O
N2
AR
)
;

reactions
{
    un-named-reaction-0
    {
        type            reversiblethirdBodyArrheniusReaction;
        reaction        "2O = O2";
        A               1.2e+11;
        beta            -1;
        Ta              0;
        coeffs          
16
(
(H2 2.4)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 15.4)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.75)
(CO2 3.6)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.83)
)
;
    }
    un-named-reaction-1
    {
        type            reversiblethirdBodyArrheniusReaction;
        reaction        "O + H = OH";
        A               5e+11;
        beta            -1;
        Ta              0;
        coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 6)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.5)
(CO2 2)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.7)
)
;
    }
    un-named-reaction-2
    {
        type            reversibleArrheniusReaction;
        reaction        "O + H2 = H + OH";
        A               38.7;
        beta            2.7;
        Ta              3149.977155;
    }
    un-named-reaction-3
    {
        type            reversibleArrheniusReaction;
        reaction        "O + HO2 = OH + O2";
        A               2e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-4
    {
        type            reversibleArrheniusReaction;
        reaction        "O + H2O2 = OH + HO2";
        A               9630;
        beta            2;
        Ta              2012.764955;
    }
    un-named-reaction-5
    {
        type            reversibleArrheniusReaction;
        reaction        "O + CH3 = H + CH2O";
        A               5.06e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-6
    {
        type            reversibleArrheniusReaction;
        reaction        "O + CH4 = OH + CH3";
        A               1020000;
        beta            1.5;
        Ta              4327.444654;
    }
    un-named-reaction-7
    {
        type            reversibleArrheniusLindemannFallOffReaction;
        reaction        "O + CO = CO2";
        k0
        {
            A               602000000;
            beta            0;
            Ta              1509.573717;
        }
        kInf
        {
            A               18000000;
            beta            0;
            Ta              1200.111105;
        }
        F
        {
        }
        thirdBodyEfficiencies
        {
            coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 6)
(OH 1)
(H2O 6)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.5)
(CO2 3.5)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.5)
)
;
        }
    }
    un-named-reaction-8
    {
        type            reversibleArrheniusReaction;
        reaction        "O + HCO = OH + CO";
        A               3e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-9
    {
        type            reversibleArrheniusReaction;
        reaction        "O + HCO = H + CO2";
        A               3e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-10
    {
        type            reversibleArrheniusReaction;
        reaction        "O + CH2O = OH + HCO";
        A               3.9e+10;
        beta            0;
        Ta              1781.296985;
    }
    un-named-reaction-11
    {
        type            reversibleArrheniusReaction;
        reaction        "O2 + CO = O + CO2";
        A               2500000000;
        beta            0;
        Ta              24052.54122;
    }
    un-named-reaction-12
    {
        type            reversibleArrheniusReaction;
        reaction        "O2 + CH2O = HO2 + HCO";
        A               1e+11;
        beta            0;
        Ta              20127.64955;
    }
    un-named-reaction-13
    {
        type            reversiblethirdBodyArrheniusReaction;
        reaction        "H + O2 = HO2";
        A               2.8e+12;
        beta            -0.86;
        Ta              0;
        coeffs          
16
(
(H2 1)
(H 1)
(O 1)
(O2 0)
(OH 1)
(H2O 0)
(HO2 1)
(H2O2 1)
(CH4 1)
(CH3 1)
(CO 0.75)
(CO2 1.5)
(HCO 1)
(CH2O 1)
(N2 0)
(AR 0)
)
;
    }
    un-named-reaction-14
    {
        type            reversibleArrheniusReaction;
        reaction        "H + 2O2 = HO2 + O2";
        A               2.08e+13;
        beta            -1.24;
        Ta              0;
    }
    un-named-reaction-15
    {
        type            reversibleArrheniusReaction;
        reaction        "H + O2 + H2O = HO2 + H2O";
        A               1.126e+13;
        beta            -0.76;
        Ta              0;
    }
    un-named-reaction-16
    {
        type            reversibleArrheniusReaction;
        reaction        "H + O2 + N2 = HO2 + N2";
        A               2.6e+13;
        beta            -1.24;
        Ta              0;
    }
    un-named-reaction-17
    {
        type            reversibleArrheniusReaction;
        reaction        "H + O2 + AR = HO2 + AR";
        A               7e+11;
        beta            -0.8;
        Ta              0;
    }
    un-named-reaction-18
    {
        type            reversibleArrheniusReaction;
        reaction        "H + O2 = O + OH";
        A               2.65e+13;
        beta            -0.6707;
        Ta              8574.881901;
    }
    un-named-reaction-19
    {
        type            reversiblethirdBodyArrheniusReaction;
        reaction        "2H = H2";
        A               1e+12;
        beta            -1;
        Ta              0;
        coeffs          
16
(
(H2 0)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 0)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1)
(CO2 0)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.63)
)
;
    }
    un-named-reaction-20
    {
        type            reversibleArrheniusReaction;
        reaction        "2H + H2 = 2H2";
        A               9e+10;
        beta            -0.6;
        Ta              0;
    }
    un-named-reaction-21
    {
        type            reversibleArrheniusReaction;
        reaction        "2H + H2O = H2 + H2O";
        A               6e+13;
        beta            -1.25;
        Ta              0;
    }
    un-named-reaction-22
    {
        type            reversibleArrheniusReaction;
        reaction        "2H + CO2 = H2 + CO2";
        A               5.5e+14;
        beta            -2;
        Ta              0;
    }
    un-named-reaction-23
    {
        type            reversiblethirdBodyArrheniusReaction;
        reaction        "H + OH = H2O";
        A               2.2e+16;
        beta            -2;
        Ta              0;
        coeffs          
16
(
(H2 0.73)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 3.65)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1)
(CO2 1)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.38)
)
;
    }
    un-named-reaction-24
    {
        type            reversibleArrheniusReaction;
        reaction        "H + HO2 = O + H2O";
        A               3970000000;
        beta            0;
        Ta              337.6413213;
    }
    un-named-reaction-25
    {
        type            reversibleArrheniusReaction;
        reaction        "H + HO2 = O2 + H2";
        A               4.48e+10;
        beta            0;
        Ta              537.4082431;
    }
    un-named-reaction-26
    {
        type            reversibleArrheniusReaction;
        reaction        "H + HO2 = 2OH";
        A               8.4e+10;
        beta            0;
        Ta              319.5264367;
    }
    un-named-reaction-27
    {
        type            reversibleArrheniusReaction;
        reaction        "H + H2O2 = HO2 + H2";
        A               12100;
        beta            2;
        Ta              2616.594442;
    }
    un-named-reaction-28
    {
        type            reversibleArrheniusReaction;
        reaction        "H + H2O2 = OH + H2O";
        A               1e+10;
        beta            0;
        Ta              1811.48846;
    }
    un-named-reaction-29
    {
        type            reversibleArrheniusTroeFallOffReaction;
        reaction        "H + CH3 = CH4";
        k0
        {
            A               2.62e+27;
            beta            -4.76;
            Ta              1227.786623;
        }
        kInf
        {
            A               1.39e+13;
            beta            -0.534;
            Ta              269.710504;
        }
        F
        {
            alpha           0.783;
            Tsss            74;
            Ts              2941;
            Tss             6964;
        }
        thirdBodyEfficiencies
        {
            coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 6)
(HO2 1)
(H2O2 1)
(CH4 3)
(CH3 1)
(CO 1.5)
(CO2 2)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.7)
)
;
        }
    }
    un-named-reaction-30
    {
        type            reversibleArrheniusReaction;
        reaction        "H + CH4 = CH3 + H2";
        A               660000;
        beta            1.62;
        Ta              5454.593029;
    }
    un-named-reaction-31
    {
        type            reversibleArrheniusTroeFallOffReaction;
        reaction        "H + HCO = CH2O";
        k0
        {
            A               2.47e+18;
            beta            -2.57;
            Ta              213.8562765;
        }
        kInf
        {
            A               1090000000;
            beta            0.48;
            Ta              -130.8297221;
        }
        F
        {
            alpha           0.7824;
            Tsss            271;
            Ts              2755;
            Tss             6570;
        }
        thirdBodyEfficiencies
        {
            coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 6)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.5)
(CO2 2)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.7)
)
;
        }
    }
    un-named-reaction-32
    {
        type            reversibleArrheniusReaction;
        reaction        "H + HCO = H2 + CO";
        A               7.34e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-33
    {
        type            reversibleArrheniusReaction;
        reaction        "H + CH2O = HCO + H2";
        A               57400;
        beta            1.9;
        Ta              1379.750377;
    }
    un-named-reaction-34
    {
        type            reversibleArrheniusTroeFallOffReaction;
        reaction        "H2 + CO = CH2O";
        k0
        {
            A               5.07e+21;
            beta            -3.42;
            Ta              42444.181;
        }
        kInf
        {
            A               43000;
            beta            1.5;
            Ta              40054.02261;
        }
        F
        {
            alpha           0.932;
            Tsss            197;
            Ts              1540;
            Tss             10300;
        }
        thirdBodyEfficiencies
        {
            coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 6)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.5)
(CO2 2)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.7)
)
;
        }
    }
    un-named-reaction-35
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + H2 = H + H2O";
        A               216000;
        beta            1.51;
        Ta              1725.945949;
    }
    un-named-reaction-36
    {
        type            reversibleArrheniusTroeFallOffReaction;
        reaction        "2OH = H2O2";
        k0
        {
            A               2.3e+12;
            beta            -0.9;
            Ta              -855.425106;
        }
        kInf
        {
            A               7.4e+10;
            beta            -0.37;
            Ta              0;
        }
        F
        {
            alpha           0.7346;
            Tsss            94;
            Ts              1756;
            Tss             5182;
        }
        thirdBodyEfficiencies
        {
            coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 6)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.5)
(CO2 2)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 0.7)
)
;
        }
    }
    un-named-reaction-37
    {
        type            reversibleArrheniusReaction;
        reaction        "2OH = O + H2O";
        A               35.7;
        beta            2.4;
        Ta              -1061.733514;
    }
    un-named-reaction-38
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + HO2 = O2 + H2O";
        A               1.45e+10;
        beta            0;
        Ta              -251.5956194;
    }
    un-named-reaction-39
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + H2O2 = HO2 + H2O";
        A               2000000000;
        beta            0;
        Ta              214.862659;
    }
    un-named-reaction-40
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + H2O2 = HO2 + H2O";
        A               1.7e+15;
        beta            0;
        Ta              14798.85433;
    }
    un-named-reaction-41
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + CH4 = CH3 + H2O";
        A               100000;
        beta            1.6;
        Ta              1569.956665;
    }
    un-named-reaction-42
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + CO = H + CO2";
        A               47600;
        beta            1.228;
        Ta              35.22338672;
    }
    un-named-reaction-43
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + HCO = H2O + CO";
        A               5e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-44
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + CH2O = HCO + H2O";
        A               3430000;
        beta            1.18;
        Ta              -224.9264838;
    }
    un-named-reaction-45
    {
        type            reversibleArrheniusReaction;
        reaction        "2HO2 = O2 + H2O2";
        A               130000000;
        beta            0;
        Ta              -820.2017193;
    }
    un-named-reaction-46
    {
        type            reversibleArrheniusReaction;
        reaction        "2HO2 = O2 + H2O2";
        A               4.2e+11;
        beta            0;
        Ta              6038.294866;
    }
    un-named-reaction-47
    {
        type            reversibleArrheniusReaction;
        reaction        "HO2 + CH3 = O2 + CH4";
        A               1000000000;
        beta            0;
        Ta              0;
    }
    un-named-reaction-48
    {
        type            reversibleArrheniusReaction;
        reaction        "HO2 + CO = OH + CO2";
        A               1.5e+11;
        beta            0;
        Ta              11875.31324;
    }
    un-named-reaction-49
    {
        type            reversibleArrheniusReaction;
        reaction        "HO2 + CH2O = HCO + H2O2";
        A               5600;
        beta            2;
        Ta              6038.294866;
    }
    un-named-reaction-50
    {
        type            reversibleArrheniusReaction;
        reaction        "CH3 + O2 = OH + CH2O";
        A               2310000000;
        beta            0;
        Ta              10222.33002;
    }
    un-named-reaction-51
    {
        type            reversibleArrheniusReaction;
        reaction        "CH3 + H2O2 = HO2 + CH4";
        A               24.5;
        beta            2.47;
        Ta              2606.530617;
    }
    un-named-reaction-52
    {
        type            reversibleArrheniusReaction;
        reaction        "CH3 + HCO = CH4 + CO";
        A               2.648e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-53
    {
        type            reversibleArrheniusReaction;
        reaction        "CH3 + CH2O = HCO + CH4";
        A               3.32;
        beta            2.81;
        Ta              2948.70066;
    }
    un-named-reaction-54
    {
        type            reversibleArrheniusReaction;
        reaction        "HCO + H2O = H + CO + H2O";
        A               1.5e+15;
        beta            -1;
        Ta              8554.25106;
    }
    un-named-reaction-55
    {
        type            reversiblethirdBodyArrheniusReaction;
        reaction        "HCO = H + CO";
        A               1.87e+14;
        beta            -1;
        Ta              8554.25106;
        coeffs          
16
(
(H2 2)
(H 1)
(O 1)
(O2 1)
(OH 1)
(H2O 0)
(HO2 1)
(H2O2 1)
(CH4 2)
(CH3 1)
(CO 1.5)
(CO2 2)
(HCO 1)
(CH2O 1)
(N2 1)
(AR 1)
)
;
    }
    un-named-reaction-56
    {
        type            reversibleArrheniusReaction;
        reaction        "HCO + O2 = HO2 + CO";
        A               1.345e+10;
        beta            0;
        Ta              201.2764955;
    }
    un-named-reaction-57
    {
        type            irreversibleArrheniusReaction;
        reaction        "O + CH3 = H + H2 + CO";
        A               3.37e+10;
        beta            0;
        Ta              0;
    }
    un-named-reaction-58
    {
        type            reversibleArrheniusReaction;
        reaction        "OH + HO2 = O2 + H2O";
        A               5e+12;
        beta            0;
        Ta              8720.304169;
    }
    un-named-reaction-59
    {
        type            irreversibleArrheniusReaction;
        reaction        "OH + CH3 = H2 + CH2O";
        A               8000000;
        beta            0.5;
        Ta              -883.1006242;
    }
}
