openFOAMTry/simFile/try2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    gox-inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    0.045;
        rho             rho;
        rhoInlet        27.7;
        value           uniform (0 0 10);
    }
    gch4-inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    0.017;
        rho             rho;
        rhoInlet        14.3;
        value           uniform (0 0 10);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    "(post_wall|chamber_wall_up|chamber_wall_side|chamber_wall_down|gch4_inlet_outer_wall|face_plate)"
    {
        type            noSlip;
    }
}
