openFOAMTry/simFile/try2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "(U|h|e|Yi)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|h|e|Yi)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    "(k|omega|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    "pFinal"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 1;
    momentumPredictor yes;
    maxCo           1.0;
    rDeltaTDampingCoeff 0.5;
    maxDeltaT       1.0;
}

LTS
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 1;
    maxCo           1.0;
    rDeltaTDampingCoeff 0.5;
    maxDeltaT       1.0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.3;
    }
    equations
    {
        "U.*"           0.5;
        "h.*"           0.5;
        "k.*"           0.7;
        "epsilon.*"     0.7;
        "omega.*"       0.7;
        "Yi.*"          0.5;
    }
}

// ************************************************************************* //
