openFOAMTry/simFile/try2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ();

regions
(
    cellToCell
    {
        set ignitionKernel;
        fieldValues
        (
            volScalarFieldValue T 2200
            volScalarFieldValue H2O 0.25
            volScalarFieldValue CO2 0.15
            volScalarFieldValue O2 0.10
            volScalarFieldValue N2 0.50
            volScalarFieldValue CO 0
            volScalarFieldValue H2 0
            volScalarFieldValue OH 0.001
            volScalarFieldValue CH4 0
        );
    }
);

// ************************************************************************* //
